export default (input: string) => {
	return input
		.replace(/\[\[\-(.*?)\]\]/g, "{*$1*}") // [[-комментарий]]
		.replace(/\[\[\~([0-9]+)\]\]/g, "{$1 | url}") // [[~URL]]
		.replace(/\[\[\%([a-zA-Z0-9\._]+)\]\]/g, "{'$1' | lexicon}") // [[%язык]]
		.replace(/\[\[\+\+([a-zA-Z0-9\._]+)\]\]/g, "{'$1' | config}") // [[++системная_настройка]]
		.replace(/\[\[(\!)?\+([a-zA-Z0-9\._]+\.[a-zA-Z0-9\._]+)\]\]/g, "{$_pls['$2']}",) // [[+плейс.холдер]]
		.replace(/\[\[(\!)?\+([a-zA-Z0-9\._]+)\]\]/g, "{$$$2}") // [[+плейсхолдер]]
		.replace(/\[\[\*([a-zA-Z0-9\._]+)\]\]/g, "{$_modx->resource.$1}") // [[*поле_ресурса]]
		.replace(/\[\[\$([a-zA-Z0-9\._]+)\]\]/g, "{'$1' | chunk}") // [[$чанк]]
		.replace(/\[\[\$([a-zA-Z0-9\._]+)\?/g, "{'$1' | chunk : [")
		.replace(/\[\[(\!)?([a-zA-Z0-9\._]+)\]\]/g, '{"$1$2" | snippet}') // [[сниппет]]
		.replace(/\[\[\#([0-9]+)\.([a-zA-Z0-9\._]+)\]\]/g, "{'$1' | resource: '$2'}") // [[#id.поле]]
		.replace(/\[\[(\!)?([a-zA-Z0-9\._]+)\?/g, '{"$1$2" | snippet : [')
		.replace(/\&([a-zA-Z0-9\._]+)=`?([^\[\]\&]+)`/g, "'$1' => '$2',") // &параметр=`значение`
		.replace(/=> '`'/g, "=> ''")
		.replace(/\',([\r\n\s\t]+)?\]\]/g, "' $1]}")
		.replace(/'(\d+)'/g, "$1"); // => '123' - значения с цифрами
};
